In [29]:
import numpy as np
import pandas as pd

# NaN y \<NA\>

In [30]:
print(np.nan)
print(np.nan + 1)
print(np.nan > 1)
# print(np.nan + 'hola') # NO SOPORTADO

nan
nan
False

In [31]:
print(pd.NA)
print(pd.NA + 1)
print(pd.NA > 1)
print(pd.NA + 'hola')

<NA>
<NA>
<NA>
<NA>

In [42]:
df = pd.DataFrame(
                    np.arange(0, 16).reshape(4, 4), 
                    columns=['a','b','c','d'])
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [45]:
df.loc[1,'b'] = np.nan
df.loc[2,'c'] = pd.NA
df.loc[3,'c'] = np.nan
df

    a     b     c   d
0   0   1.0     2   3
1   4   NaN     6   7
2   8   9.0  <NA>  11
3  12  13.0   NaN  15

Para reconocer valores nulos del DF

In [47]:
df.isnull()
df.isna()

       a      b      c      d
0  False  False  False  False
1  False   True  False  False
2  False  False   True  False
3  False  False   True  False

Contar variables nulas por columna y fila

In [48]:
df.isnull().sum()

a    0
b    1
c    2
d    0
dtype: int64

In [50]:
df.isnull().sum(axis=1)

0    0
1    1
2    1
3    1
dtype: int64

In [54]:
df.isnull().sum().sum()

3

Filtrar por las variables no nulas de la columna 'c'

In [55]:
df[df['c'].notnull()]

   a    b  c  d
0  0  1.0  2  3
1  4  NaN  6  7

Borrar filas que tengan alg√∫n null

In [56]:
df.dropna()

   a    b  c  d
0  0  1.0  2  3

Reemplazar las variables nulas

In [60]:
df.fillna(999)
# method="ffill"
# method="bfill"

    a      b    c   d
0   0    1.0    2   3
1   4  999.0    6   7
2   8    9.0  999  11
3  12   13.0  999  15

# DUPLICATED

In [32]:
df = pd.DataFrame({'a': ['w'] * 3 + ['x'] * 2 + ['y'] + ['z'], 
                   'b': [1, 1, 1, 2, 2, 3, 4]})
df

   a  b
0  w  1
1  w  1
2  w  1
3  x  2
4  x  2
5  y  3
6  z  4

In [33]:
df.duplicated()
# keep='first o keep='last

0    False
1     True
2     True
3    False
4     True
5    False
6    False
dtype: bool

In [34]:
df[~ df.duplicated()]

   a  b
0  w  1
3  x  2
5  y  3
6  z  4

Para ver los registros que tienen duplicados

In [35]:
df[df.duplicated(keep=False)]

   a  b
0  w  1
1  w  1
2  w  1
3  x  2
4  x  2

Para eliminar los duplicados

In [36]:
df.drop_duplicates()

   a  b
0  w  1
3  x  2
5  y  3
6  z  4

Borrar duplicados pero solo teniendo en cuenta una columna

In [37]:
# df.drop_duplicates(subset=['a'],keep='last')
df.drop_duplicates(['a'],keep='last')

   a  b
2  w  1
4  x  2
5  y  3
6  z  4